Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.Scale
The scaling factor for length measurements from the default Revit units to the export units.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.CustomAxis
The custom axis to try (if extrusionAxes includes an option for a custom direction).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.ExtrusionAxes
The extrusion axes to try when doing the calculation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.#ctor(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCExtrusionAxes,Autodesk.Revit.DB.XYZ,System.Double)
Constructs a new instance of a class used to calculate extrusions from Revit geometry.
exporterIFC:
The exporter.
extrusionAxes:
The extrusion axes to try when doing the calculation.
customAxis:
The custom axis to try (if extrusionAxes includes an option for a custom direction).
scale:
The scaling factor for length measurements from the default Revit units to the export units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions
This class contains the options used to calculate extrusions from Revit geometry.
Since:
2012